#include <iostream>

int main() {
  int money;
  std::cout << "Банкомат выдает только купюры достоинством 100, 200, 500, 1000, 2000 5000 рублей.\n";
  std::cout << "Максимально возможная сумма для снятия 150000.\n";
  std::cout << "Сколько снимаем? ";
  std::cin >> money;
  if (money % 100 == 0 && money <= 150000)
  {
    if (money>=5000) {
      std::cout << "Выдаем  " << money / 5000 << " купюр номиналом 5000 рублей.\n";
      money %= 5000;
    }
    if (money>=2000) {
      std::cout << "Выдаем  " << money / 2000 << " купюр номиналом 2000 рублей.\n";
      money %= 2000;
    }
    if (money>=1000) {
      std::cout << "Выдаем  " << money / 1000 << " купюр номиналом 1000 рублей.\n";
      money %= 1000;
    }
     if (money>=500) {
      std::cout << "Выдаем  " << money / 500 << " купюр номиналом 500 рублей.\n";
      money %= 500;
    }
     if (money>=200) {
      std::cout << "Выдаем  " << money / 200 << " купюр номиналом 200 рублей.\n";
      money %= 200;
    } 
    if (money>=100) {
      std::cout << "Выдаем  " << money / 100 << " купюр номиналом 100 рублей.\n";
    }
  } else
  {
    std::cout << "Введена некорректная сумма!\n";
  }
}